content/blog/kubernetes-native-phoenix-apps-part-3.md
+++
title = "Kubernetes Native Phoenix Apps: Part 3"
author = ["Shane Sveller"]
date = 2018-11-16T12:25:00-06:00
lastmod = 2018-11-16T13:40:14-06:00
tags = ["docker", "elixir", "helm", "phoenix", "umbrella", "kubernetes"]
categories = ["elixir"]
draft = false
+++

Now that we've established a viable workflow for building and running our
application in Docker containers, it's time to take our first pass at
running those containers on Kubernetes!

<!--more-->

Published articles in this series:

-   [Introduction](/blog/2018/10/28/kubernetes-native-phoenix-apps-introduction/)
-   [Part 1](/blog/2018/10/28/kubernetes-native-phoenix-apps-part-1/)
-   [Part 2](/blog/2018/11/13/kubernetes-native-phoenix-apps-part-2/)
-   Part 3 (this post)

To test our application in a Kubernetes environment, we have two available
routes: we can publish our Docker images to a public or private Docker
registry, and then deploy those images to a "real" cluster, or we can use
[Minikube](https://github.com/kubernetes/minikube) and build our images directly on the Minikube VM. For illustrative
purposes, let's start with the latter approach first.

As a reminder of what I wrote in the Introduction post, we will be glossing
over a lot of Kubernetes/Elixir/Phoenix fundamentals in this series and
trying to refer to existing documentation as often as possible. The purpose
of this series is more oriented around synthesizing a working solution from
disparate learnings. If you have unanswered questions, please feel free to
leave a comment and I'll try to direct you to the right learning resources.


## Building Docker images for Minikube {#building-docker-images-for-minikube}

I'm using a [mildly customized Minikube configuration](#preferred-minikube-config) that more closely
matches my long-term target environment, which is [Google Container Engine](https://cloud.google.com/kubernetes-engine/).
However, one of the powerful benefits of targeting Kubernetes as a platform
is that the the content below is, for most purposes, compatible across many
different cloud providers as long as you're running a conformant cluster.

To build Docker images for Minikube specifically, we can directly re-use
the Docker daemon that is installed as part of the Minikube virtual
machine. This method can be very expedient, but is not compatible with a
"real" cluster, so we will need another path forward later on in the
series.

First, we use `eval` to set some environment variables that tell the local
`docker` CLI, perhaps the one included with Docker For Mac, how to talk to
the VM's Docker daemon. You don't need the actual Docker for Mac
application running to use this technique, but you do need to have it
installed. If you're using my specific Minikube config, you'll also want to
install the Hyperkit driver [as documented by the Minikube project](https://github.com/kubernetes/minikube/blob/v0.30.0/docs/drivers.md#hyperkit-driver).

After using the `eval` command, most if not all standard Docker CLI
subcommands should work correctly, so you can use `ps` to inspect running
containers (and get a glimpse of the inner structure of a Pod), or `images`
to inspect locally available Docker images. You can obtain extra images
with `pull` or `build`, and so on. In our case, we're going to use `build`
to construct our local image for our [application](https://github.com/shanesveller/kube-native-phoenix), which will then be
available to the Kubernetes scheduler for use with Pods later on.

```shell
eval $(minikube docker-env)
docker build -t kube-native:latest .
```

At the time of writing, we can't use `docker-compose` directly with Minikube
due to version incompatibilities, but we could ostensibly use `docker run`
with some extra arguments to match the container definition from our
`docker-compose.yml` file. However, this knowledge doesn't transfer
especially well into Kubernetes usage, and won't integrate at all with the
networking abstractions provided by Service objects, so I will leave that
step as an optional exercise for the reader.


## A taste of Helm {#a-taste-of-helm}

In order to successfully deploy our application, we need access to a
PostgreSQL database. There are a lot of avenues available to us, including
managed offerings like [Amazon RDS](https://aws.amazon.com/rds/) or [Google Cloud SQL](https://cloud.google.com/sql/docs/). Those services are
definitely where I would direct most people for production purposes.
Running your own highly-available database is challenging, isn't
particularly differentiating for most businesses, and isn't within most
organization's core competencies. Doing so within a containerized
environment is still more challenging, and usually isn't recommended.

Later on in this series, we'll touch on the topic of "controllers" and
"operators" for Kubernetes, which can distill and embody human expertise to
make managing containerized software more successful. Among those available
tools are a few options for managing containerized databases. We likely
won't tackle that specific example directly, but we will definitely
leverage a few of the other operators.

For our purposes, all we specifically care about at the moment are that
there is a database available for our use, and that our running Pods can
connect to it. Since we're not being picky about the other details, let's
go ahead and run a database on our Kubernetes cluster anyway.

We could synthesize the necessary Kubernetes YAML to do so on our own, but
we're about to do that for our in-house application in another section of
this post, so let's use the "off-the-shelf" approach made possible by the
community tool [Helm](https://github.com/helm/helm). The Helm user community contributes a fairly robust
body of packages for use with Helm, called Charts, which are available on
[GitHub](https://github.com/helm/charts). Later on in the series, we'll be authoring our own Chart for our
application.


#### Helm Glossary {#helm-glossary}

Tiller
: server-side component of the Helm suite, which runs
    on-cluster and interacts with the Kubernetes API on our
    behalf

Helm
: CLI component of the Helm suite, which communicates with Tiller
    via gRPC

Chart
: a package of templatized Kubernetes YAML which can be managed
    via Helm/Tiller to provide functionality to your cluster, or
    to your customers

Repository
: Collection of Helm charts made available directly for use
    via the Helm CLI

Release
: an instantiated/deployed copy of a Chart, which represents a
    collection of Kubernetes resources and can be managed in an
    ongoing fashion with the Helm CLI for upgrades, rollbacks,
    and deletion
