content/blog/kubernetes-native-phoenix-apps-part-3.md


#### Installing Tiller {#installing-tiller}

Helm needs a server-side component named Tiller, and there's a lot of
reading to be done about how to manage this component safely and securely
for production use, and the practices there will likely change drastically
when Helm v3 releases in the next year or two. This example configuration
does **not** include TLS support and uses cluster-wide administrative
privileges, so it is not particularly reflective of good production
practices.

For more information, see the Helm documentation around [RBAC](https://docs.helm.sh/using%5Fhelm/#role-based-access-control), [TLS](https://docs.helm.sh/using%5Fhelm/#using-ssl-between-helm-and-tiller), and
[general security models](https://docs.helm.sh/using%5Fhelm/#securing-your-helm-installation). Angus Lees of Bitnami also wrote [a really nice
piece](https://engineering.bitnami.com/articles/helm-security.html) about hardening Helm.

We need a ServiceAccount for Tiller to use in its API calls, and that
ServiceAccount needs to have administrative privileges on the cluster. We
also don't want to keep an unbounded amount of history around for Helm
releases, so we cap that at 10 historical versions per Release.

```shell
kubectl -n kube-system create sa tiller
kubectl create clusterrolebinding tiller \
        --clusterrole cluster-admin \
        --serviceaccount=kube-system:tiller
helm init --history-max 10 \
     --service-account tiller \
     --skip-refresh --upgrade --wait
```


#### Installing PostgreSQL {#installing-postgresql}

Public repositories of Helm Charts can be managed through the `helm repo`
subcommands, and we need to make sure that the "stable" repository, which
matches the content of the `helm/charts` GitHub repository, are available
for use.

```shell
helm repo add stable https://kubernetes-charts.storage.googleapis.com
```

Then, we're going to look at what configuration options, or Values, are
included with the Chart we want to use. Much like other content in the
Kubernetes ecosystem, these are always rendered and authored using the
YAML format. Many Charts have fairly descriptive names and even
documentation comments on their Values files, but you ultimately may need
to visit the Chart's README or even peruse the source of the Chart to
determine exactly what tunable variables are available and what values
are acceptable to use.

```yaml
helm inspect values stable/postgresql --version 0.19.0
```

Finally, after identifying the immediately-relevant settings from the
Values data, we're going to tweak some of those Values as part of the
`helm install` command that is used to deploy the PostgreSQL container.
The first pass uses the flags `--debug` and `--dry-run` to emit the
generated YAML to STDOUT for inspection, then the command is repeated
without those flags in order to actually enact the changes. A `--wait`
flag is included in order to block the completion of the command until
those new resources are fully ready. Later on we'll see how a tool called
`helmfile` can expedite this inspect-and-approve workflow.

```shell
helm install stable/postgresql \
     --name kube-native-postgresql \
     --namespace kube-native \
     --set-string imageTag=10.5-alpine \
     --set-string postgresUser=kube_native \
     --set-string postgresDatabase=kube_native \
     --set-string postgresPassword=kube_native \
     --version 0.19 \
     --debug --dry-run
helm install stable/postgresql \
     --name kube-native-postgresql \
     --namespace kube-native \
     --set-string imageTag=10.5-alpine \
     --set-string postgresUser=kube_native \
     --set-string postgresDatabase=kube_native \
     --set-string postgresPassword=kube_native \
     --version 0.19 \
     --wait
```

You'll notice that I'm choosing a particular, and rather outdated,
version of the Chart in the commands above. That's because in the pre-1.0
series of this chart, its functionality was based directly on the
official `postgres` Docker image from [Docker Hub](https://hub.docker.com/%5F/postgres/). Later iterations of the
chart, particularly the 1.x and 2.x series, made drastic changes to both
the Values schema and to the base image, which was moved to [a
Bitnami-managed image](https://github.com/bitnami/bitnami-docker-postgresql).

In my recent experiences, these newer Chart versions and the Bitnami
image were both somewhat brittle and proved to be fast-moving targets,
while the 0.x series of the Chart and the official Hub image have proved
satisfactory for several months. I opted for a lower maintenance burden
for the purposes of this series.

> Note that release names and namespaces both cannot contain underscores,
> only hyphens.

If we want to perform a quick sanity check of our new database, we can
use `kubectl port-forward` to connect to it directly with the
preconfigured credentials.

```shell
# straight from the Helm chart's install notes
# helm status kube-native-postgresql
export POD_NAME=$(kubectl get pods --namespace kube-native -l "app=postgresql,release=kube-native-postgresql" -o jsonpath="{.items[0].metadata.name}")
kubectl port-forward --namespace kube-native $POD_NAME 15432:5432

# new shell session
psql postgres -U kube_native -p 15432 -h localhost
\l
\q
```


## Describing our application on Kubernetes' terms {#describing-our-application-on-kubernetes-terms}

Now that we have a viable database to work with, let's set about actually
running our application using standard Kubernetes primitives and unadorned
YAML. We'll introduce some more refined workflows and tools later in the
series.


### ConfigMap {#configmap}

First up is creating a home for our non-sensitive configuration details
that are supplied via environment variables. We set the stage for the
Elixir side of this 12-factor-ish configuration style [back in Part 2](/blog/2018/11/13/kubernetes-native-phoenix-apps-part-2/#other-configuration-and-secrets).

These values are intentionally very similar to what we included in
the `docker-compose.yml`'s `environment` block for the application
container.

Farther down in the Deployment manifest, you'll see that each entry within
`data` appears within the container as an environment variable with the
same name and the associated value, via `envFrom`. As all environment
variables in the Deployment manifest must be strings, we have to quote any
ambiguous values that could be inferred as another value type.

{{< highlight yaml "linenos=table, linenostart=1" >}}
apiVersion: v1
kind: ConfigMap
metadata:
  name: kube-native-env
  labels:
    app: kube-native
    data:
      HOSTNAME: localhost
      # cannot be a YAML number, thus the quotes
      PORT: "4000"
      # cannot be a YAML boolean true, thus the quotes
      REPLACE_OS_VARS: "true"
{{< /highlight >}}

We instantiate this ConfigMap with `kubectl apply`:

```shell
kubectl apply -n kube-native -f configmap.yaml
```
