content/blog/kubernetes-native-phoenix-apps-part-3.md


### Secret {#secret}

We also already have a few pieces of sensitive information that need to be
supplied as environment variables as well, and for that we'll use a
Kubernetes Secret. It's worthwhile to remind readers that Secrets are not
without flaws, and chief among them is that their YAML representation
isn't truly encrypted, merely a base64 encoding of their contents.
Permissions for accessing a Secret are essentially only constrained by
your cluster's RBAC rules, and anyone with a `cluster-admin` Role can
essentially read any Secret they like. It also takes [a fair amoung of
extra effort](https://kubernetes.io/docs/tasks/administer-cluster/encrypt-data/) to ensure that both your `etcd` data and Secrets data within
etcd are encrypted at rest, and some platforms intentionally don't even
allow you to interact with etcd directly.

A step up from Kubernetes Secrets, which potentially entails quite a bit
more infrastructure and cognitive/technical burden, would be to use
something like [Vault](https://www.vaultproject.io/) that provides more robust secrets management. There
are open-source tools available for managing a Vault cluster on top of
Kubernetes, including an [Operator](https://github.com/coreos/vault-operator) that configures Vault to use etcd for
its internal storage instead of [Consul](https://www.consul.io/).

In the sample below, each entry within `data` represents an environment
variable, while its value is a base64-encoded form of the raw string like
we used with `docker-compose.yml`. In each case, it's generally important
to ensure that no wayward newlines wind up as part of the encoded value,
because tools like Ecto won't appreciate trying to parse that. As with the
ConfigMap above, these correspond with keys we provided in the
`docker-compose.yml`'s `environment` section.

Among other techniques, you can encode a value for use in a Secret by
using `echo -n` and piping it to `base64`, and you can decode it by piping
the encoded string to `base64 -D` instead. Note that these commands are
very likely to be persisted into your local shell history. Anyone with
access to your shell and a bit of knowledge could read them back out.
Right now that doesn't matter because they'd only be able to compromise
our Minikube environment, but this is still a drawback to be aware of.
Check the appendix for [some references](#preventing-shell-history) around preventing this information
from entering your shell history. Several text editors, Emacs in
particular, have direct support for base64 encoding and decoding strings
in-line.

{{< highlight yaml "linenos=table, linenostart=1" >}}
apiVersion: v1
kind: Secret
type: Opaque
metadata:
  name: kube-native-env-secret
  labels:
    app: kube-native
    data:
      # echo -n "string" | base64
      # ecto://kube_native:kube_native@kube-native-postgresql.kube-native.svc.cluster.local/kube_native
      DATABASE_URL: ZWN0bzovL2t1YmVfbmF0aXZlOmt1YmVfbmF0aXZlQGt1YmUtbmF0aXZlLXBvc3RncmVzcWwua3ViZS1uYXRpdmUuc3ZjLmNsdXN0ZXIubG9jYWwva3ViZV9uYXRpdmU=
      # "cookie"
      ERLANG_COOKIE: Y29va2ll
      # value from docker-compose.yml, base64-encoded
      SECRET_KEY_BASE: ZnpCazhPRWNJOHRoR3hseXBXUFVxZlIydzJXb3BkTjh2OHBtcHV5MkpOajJlZXJiWUZubGVjdVZNckZQR1luVw==
{{< /highlight >}}

The first substantial change from our `docker-compose.yml` content is to
make sure that we're referring to the new PostgreSQL Service we
provisioned via Helm above, by using its DNS hostname.

The default domain suffix on every Kubernetes cluster is
`svc.cluster.local`, so referring to any Service via DNS takes the
following form:

`service-name.namespace.svc.cluster.local`

For our PostgreSQL service, that gives us:

`kube-native-postgresql.kube-native.svc.cluster.local`

You can verify that you have the right Service name with:

```shell
kubectl get svc -n kube-native
```

Among the output of the above is the service's ClusterIP, which should
directly match how the DNS name resolves inside your container, unless
you've customized a Pod's `dnsConfig` or `dnsPolicy` via its `spec`.

Once again, we install this Secret with `kubectl apply`:

```shell
kubectl apply -n kube-native -f secret.yaml
```

There are also several variations of `kubectl create secret` that would
allow you to supply raw values and it will base64-encode them for you, but
this is less conducive to iterative updates. I find that approach the most
helpful when dealing with pre-existing TLS certificates and keys, as we'll
see later in the series.
