content/blog/kubernetes-native-phoenix-apps-part-3.md


### Deployment {#deployment}

Now that the necessary configuration data has been written, we need to
define the actual behavior of the running container. This is noticeably
more verbose than a comparable `docker-compose.yml` service, but every
piece has its purpose, and much of it represents functionality that
Docker Compose does not provide.

The complete file:

{{< highlight yaml "linenos=table, linenostart=1" >}}
apiVersion: apps/v1beta2
kind: Deployment
metadata:
  name: kube-native
  labels:
    app: kube-native
spec:
  replicas: 1
  revisionHistoryLimit: 10
  selector:
    matchLabels:
      app: kube-native
  strategy:
    rollingUpdate:
      maxSurge: 10%
      maxUnavailable: 0
    type: RollingUpdate
  template:
    metadata:
      labels:
        app: kube-native
    spec:
      containers:
        - name: kube-native
          image: kube-native:latest
          imagePullPolicy: Never # Always, IfNotPresent, Never
          env:
            - name: POD_IP
              valueFrom:
                fieldRef:
                  fieldPath: status.podIP
          envFrom:
            - configMapRef:
                name: kube-native-env
            - secretRef:
                name: kube-native-env-secret
          ports:
            - name: http
              containerPort: 4000
              protocol: TCP
          livenessProbe:
            exec:
              command:
                - /app/bin/kube_native_umbrella
                - ping
            initialDelaySeconds: 5
            periodSeconds: 30
            timeoutSeconds: 5
          readinessProbe:
            httpGet:
              path: /
              port: http
            initialDelaySeconds: 5
          resources:
            limits:
              cpu: 1000m
              memory: 256Mi
            requests:
              cpu: 250m
              memory: 128Mi
{{< /highlight >}}

We'll work our way through the highlights of this content, little by
little. Much of the prose description will describe fields using a
dot-separated notation, such as `spec.template.metadata`, which matches
the syntax you can use with the **incredibly handy** `kubectl explain`
command to see more detail about that portion of the manifest schema.

> Please forgive the lack of proper indentation on each smaller snippet - I
> don't appear to have enough control with Hugo to force indentation without
> introducing extra content that wasn't really there in the complete example.

This first section of the `spec` describes "meta" behavior around the
Deployment and how it manages its underlying ReplicaSets. Specifically, it
caps the historical limit to 10 unique iterations, and asserts that
rolling updates must be performed in an **additive** way. Rather than taking
down old Pods and replacing them with new ones, in that order, it instead
will launch new Pods running any updated image or behavior, wait for them
to validate as healthy, and _then_ remove an equivalent number of old
Pods. As written, it allows up to 10% of your stable target capacity to be
duplicated with newer Pods during the upgrade process, and when a
successful deploy is complete, you should be back at your target number of
replicas.

For `spec.selector`, make sure that you have **just enough** labels to
uniquely identify your workload compared to any of its siblings from the
same Kubernetes namespace, without being too precise. In particular, omit
any labels that you might change with each iterative deployment of your
application, such as a version number. If you include such details, you
are running the risk of creating "orphaned" ReplicaSets that don't get
properly reaped or managed by the Deployment object.

{{< highlight yaml "linenos=table, linenostart=7, hl_lines=3 7-11" >}}
spec:
  replicas: 1
  revisionHistoryLimit: 10
  selector:
    matchLabels:
      app: kube-native
  strategy:
    rollingUpdate:
      maxSurge: 10%
      maxUnavailable: 0
    type: RollingUpdate
{{< /highlight >}}

The `spec.template.metadata.labels` should be either an exact match or
superset of the `spec.selector.matchLabels` above. It's fine to include
additional labels as well. Some sorts of information belong in
`annotations` instead. One useful heuristic is the following question: **Do
I need to query and filter my Pods by this property?** If the answer is
yes, the information probably belongs in a label, if no, it probably
belongs in an annotation.

Note that just about any property within the `spec.template` that gets
changed will trigger a rollout of new Pods, so be mindful of what
information you include. Volatile details like a CI/CD build number may
cause unnecessary churn of your running Pods when their configuration has
not changed in other, more semantically meaningful ways.

`spec.template.spec.containers.image` and `.imagePullPolicy` are how we
dictate which image should be running within the Pod. I've included a
traditionally-reviled practice in this snippet, which is using the
`latest` tag on my Docker image. There are almost no circumstances where
you actually want to use this `latest` tag for serious work, however
expedient it may be. A more sustainable approach is to tag your images
semantically - perhaps with version numbers for your project, a time or
date stamp, a git SHA, or even some combination of the proceeding
identifiers. This lets you reason very specifically about what iteration
of your application is currently running or meant to be running, without
using information that you can only obtain after building the image, such
as its built-in SHA256 digest.

Because we're using a Minikube-based environment in this phase, I've also
set the `imagePullPolicy` to a value of `Never`, because there's nowhere
for the VM to obtain this image if it's not already built locally. In a
live cluster with a remote Docker image registry, we'd generally use one
of `IfNotPresent`, if we're treating image tags as immutable, or `Always`,
if we treat some or all image tags as mutable.

{{< highlight yaml "linenos=table, linenostart=18, hl_lines=8-9" >}}
template:
  metadata:
    labels:
      app: kube-native
  spec:
    containers:
      - name: kube-native
        image: kube-native:latest
        imagePullPolicy: Never # Always, IfNotPresent, Never
{{< /highlight >}}

Within `spec.template.spec.containers.env` we're using the [Downward API](https://kubernetes.io/docs/tasks/inject-data-application/environment-variable-expose-pod-information/) to
expose the Pod's own IP address as an environment variable, which will be
consumed by our Distillery-managed configuration to set the BEAM node name.

We're also using `.envFrom` to source environment variables directly from
our ConfigMap and Secret above.

{{< highlight yaml "linenos=table, linenostart=27" >}}
env:
  - name: POD_IP
    valueFrom:
      fieldRef:
        fieldPath: status.podIP
envFrom:
  - configMapRef:
      name: kube-native-env
  - secretRef:
      name: kube-native-env-secret
{{< /highlight >}}

In order to actually serve traffic from our Pod, we need to expose our HTTP
listener port `4000` to the private network. We give each port a `name` so
that we can refer to it later in the Service declaration, without needing
to remember to update both places if and when a port number changes. Port
names have to be viable for use with DNS notation, so there are some
restrictions on what non-alphanumeric characters can be included.

Notice that we're not making any mention of any of the ports that are
necessary for Distributed Erlang, EPMD, etc. This is intentional! We'll see
later in the series that clustering and distribution don't need those ports
to be formally exposed, because we have a fully routable private network
space to communicate within. This is somewhat unique compared to other
platforms, such as Amazon ECS.

If you have sudden doubts about the security posture of this private
networking model, you'll want to brush up on the [NetworkPolicy](https://kubernetes.io/docs/concepts/services-networking/network-policies/) resource
type, which requires a supported CNI driver for enforcement. Many
Kubernetes providers support this out of the box or with opt-in
configuration. At the time of writing, GKE uses [Calico](https://www.projectcalico.org/) and an opt-in flag
at cluster creation time, which can also be enabled for existing clusters.

{{< highlight yaml "linenos=table, linenostart=37" >}}
ports:
  - name: http
    containerPort: 4000
    protocol: TCP
{{< /highlight >}}

One of the ways that Kubernetes can help us manage our application's
availability is by continually performing regular health-checking tasks on
our behalf, and responding appropriately to indications of bad container
health.

The YAML below describes two classes of Probes. Failures of a **readiness
probe** will remove the Pod for consideration by Service network traffic,
while a sufficient number of failures of a **liveness probe** will cause
Kubernetes to **restart the container**. A good heuristic to follow is that
readiness probes should fail in circumstances that are possible to
self-heal from without restarting your application, while a liveness probe
should represent a very real failure that can't be resolved with patience
or internal behavior.

Note also that these automatic restarts from liveness probes will contribue
to `CrashLoopBackOff` conditions, and a poorly-tuned or misconfigured probe
may inadvertantly cause more availability problems than they solve.

Our `readinessProbe` currently issues a GET request directly to the root
URL of our Phoenix application. This is a somewhat useful litmus test, but
be wary if the query footprint or other performance characteristics of that
root URL start to grow - these probes are tunable but by default those
requests happen **every 10 seconds, per-Pod**. If the homepage gets to be too
heavy, it's common to create a specific Plug endpoint just for
health-checking purposes, but ideally that endpoint should perform a quick
round-trip to the database to ensure correct credentials.

The `livenessProbe` uses a facility built into the Distillery-provided CLI
to `ping` our BEAM process and wait for a response. If the BEAM is in a
truly bad state this will fail as intended, but under heavy workloads it
potentially can exceed the default timeout of 1 second to come back.

{{< highlight yaml "linenos=table, linenostart=41" >}}
livenessProbe:
  exec:
    command:
      - /app/bin/kube_native_umbrella
      - ping
  initialDelaySeconds: 5
  periodSeconds: 30
  timeoutSeconds: 5
readinessProbe:
  httpGet:
    path: /
    port: http
  initialDelaySeconds: 5
{{< /highlight >}}

Finally, we can help maintain the quality-of-service within the overall
cluster by describing the resources that need to be allocated on a per-Pod
basis. The cluster's scheduler uses this information to determine which
Pods, how many Pods, and so on that each available Node can execute without
becoming overloaded. If you provide matching values for both `limits` and
`requests`, your pod is treated as having a guaranteed quality of service,
while any mismatch between the two allows for "bursting" behavior but a
less stringent QOS. Take a look at the [Kubernetes documentation](https://kubernetes.io/docs/concepts/configuration/manage-compute-resources-container/) for more
details.

These specific numbers are both arbitrary and generous for the content of
the example application. The units are expressed in "millicores" for CPU,
where 1000 represents one full second of one full CPU core, and
[mebibytes/gibibytes/etc](https://en.wikipedia.org/wiki/Mebibyte). for memory. Ideally, you should perform empirical
measurements against an un-constrained version of your application in a
live cluster with meaningful traffic to determine more appropriate values
for your use-case.

Later in the series we'll discuss how to do this with a tool called
Prometheus, which is very popular to use in conjunction with Kubernetes. It
would also be a fairly reasonable starting point to base these figures on
your observed metrics from Erlang's Observer, provided you're running on a
similar OS with the right `MIX_ENV` and representative samples of traffic.
It's even possible to perform Pod-level autoscaling based on these metrics,
which is a very exciting opportunity and can be much more meaningful than
pure CPU/Memory utilization figures.

In practical terms it's not really possible to exceed the supplied CPU
limits due to how they're applied via `cgroups`, but you may find the
application becomes "starved" or unable to sustain the expected throughput.
Your main options there are to allocate more CPU and/or memory per-Pod, or
perhaps more readily available, to just run more Pod replicas to distribute
the traffic evenly across a larger pool of application Pods. If you'd like
to see the specifics of how CPU shares are enforced, take a look at the
[Docker documentation](https://docs.docker.com/config/containers/resource%5Fconstraints/#cpu).

Memory is a slightly more nuanced constraint that is [documented on Docker's
site](https://docs.docker.com/config/containers/resource%5Fconstraints/#limit-a-containers-access-to-memory), where Kubernetes is applying the `--memory` flag for you based on the
Pod's resource allocation. One thing to note if the `limit` and `request`
differ is that your Pod can attempt and sometimes even succeed at
allocating more memory than the `request` value, and will be allowed to
continue using it for as long as it does not exceed the `limit`, and for as
long as there aren't low-memory conditions on the Node's host OS.

{{< highlight yaml "linenos=table, linenostart=54" >}}
resources:
  limits:
    cpu: 1000m
    memory: 256Mi
  requests:
    cpu: 250m
    memory: 128Mi
{{< /highlight >}}

We can start a running Pod on our cluster using `kubectl`, and tweak its
replica count on the fly without using `kubectl edit` or `kubectl apply`
again later, including scaling the Deployment to `0` replicas if that's an
appropriate move.

```shell
kubectl apply -n kube-native -f deployment.yaml
kubectl scale deployment -n kube-native kube-native --replicas=3
```
