blog.org
***** Service

      Now that we have running containers, we want to distribute incoming
      traffic across the ready replicas equally. For that we'll create a
      Service, which targets a similar ~selector~ as the Deployment used, and
      exposes a *Service* port that forwards traffic to the *Pod* port. The
      exposed port on the service does not have to match the Pod's port in
      number, but every Service port must target an existing port name or number
      on the Pod.

      In Minikube, we must use ClusterIP or NodePort services as it doesn't have
      any facilities for managing an external LoadBalancer. ClusterIP would only
      allow traffic from other Pods, so we'll go with NodePort, which will
      expose a high-numbered port on the Minikube VM itself for external traffic.

      #+BEGIN_SRC yaml -n
        apiVersion: v1
        kind: Service
        metadata:
          name: kube-native
          labels:
            app: kube-native
        spec:
          type: NodePort # LoadBalancer, NodePort, ClusterIP
          ports:
            - port: 80
              targetPort: http
              protocol: TCP
              name: http
          selector:
            app: kube-native
      #+END_SRC

      Our trusty ~kubectl apply~ comes to our rescue again:

      #+BEGIN_SRC shell
        kubectl apply -n kube-native -f service.yaml
      #+END_SRC

**** Running Migrations

      With our application running, we still need to perform our database
      migrations. There are two techniques that are readily available to us for
      this purpose, with different trade-offs.

      You'll recall that we created our ~ReleaseTasks~ module and the associated
      Distillery custom commands in [[/blog/2018/11/13/kubernetes-native-phoenix-apps-part-2/#running-migrations-and-seeds][Part 2]], so now we need to trigger that
      behavior in a Kubernetes Pod context instead.

***** Running migrations/seeds via ~kubectl exec~

      The first and simplest technique is to simply connect to a running
      application Pod via ~kubectl exec~, and trigger our migrations via the
      Distillery-provided CLI:

      #+BEGIN_SRC shell
        kubectl get pods -o wide -n kube-native
        kubectl exec -it $pod_name sh
        bin/kube_native_umbrella migrate
        bin/kube_native_umbrella seed
      #+END_SRC

      This isn't super sustainable and can be quite error-prone, and if our
      application fails to boot successfully without its migrations, we'd be
      unable to use this approach without resolving that first, which may be a
      chicken-and-egg problem. The next section introduces a more complex but
      more satisfactory approach.

***** Running migrations/seeds via Jobs

      A preferable method to perform our migrations is to create a Job object
      that executes the same Docker image as our deployment, but uses its
      ~migrate~ or ~seed~ subcommand and doesn't expose any ports. A sample
      appears below, with highlights on the meaningfully different lines. In
      most ways, this directly resembles the Deployment template above, adjusted
      for the schema for a Job object and omitting the ports list and probes.
      All we care about here is whether our command eventually exits 0.

      Note that the Job name should be unique per-namespace, or else you'll need
      to delete and recreate the resource to run another round of migrations,
      which is tedious if not actually problematic. We'll see a convenient way
      to automate this as part of the next post in the series, covering Helm.

      #+BEGIN_SRC yaml -n :hl_lines 13,18
        apiVersion: batch/v1
        kind: Job
        metadata:
          name: kube-native-migration-0
          labels:
            app: kube-native
        spec:
          template:
            metadata:
              labels:
                app: kube-native
            spec:
              restartPolicy: OnFailure
              containers:
                - name: kube-native
                  image: kube-native:latest
                  imagePullPolicy: IfNotPresent
                  args: ["migrate"]
                  env:
                    - name: POD_IP
                      valueFrom:
                        fieldRef:
                          fieldPath: status.podIP
                  envFrom:
                    - configMapRef:
                        name: kube-native-env
                    - secretRef:
                        name: kube-native-env-secret
                  resources:
                    limits:
                      cpu: 1000m
                      memory: 256Mi
                    requests:
                      cpu: 250m
                      memory: 128Mi
      #+END_SRC

      Once last time, we create the Job resource with ~kubectl apply~:

      #+BEGIN_SRC shell
        kubectl apply -n kube-native -f job.yaml
      #+END_SRC

**** Browsing the live application

      With our migrations applied and the Service has ready Endpoints, you can
      visit the application in your browser with a single command, or just echo
      the appropriate URL in your shell for later reference:

      #+BEGIN_SRC shell
        minikube service -n kube-native kube-native
        minikube service -n kube-native kube-native --url
      #+END_SRC

**** Code Checkpoint

     The work presented in this post is reflected in git tag ~part-3-end~
     available [[https://github.com/shanesveller/kube-native-phoenix/tree/part-3-end][here]]. You can compare these changes to the previous post [[https://github.com/shanesveller/kube-native-phoenix/compare/part-3-start...part-3-end][here]].

**** Acknowledgements

     Thanks to early readers Eric Oestrich, Dan Lindeman, and Justin Nauman for
     their feedback. Any remaining flaws are my own.

**** Appendix

***** Software/Tool Versions

      | Software   |    Version |
      |------------+------------|
      | Distillery |     2.0.12 |
      | Docker     | 18.06.1-ce |
      | Ecto       |      3.0.1 |
      | Elixir     |      1.7.4 |
      | Erlang     |     21.1.1 |
      | Helm       |     2.11.0 |
      | Minikube   |     0.30.0 |
      | Phoenix    |      1.4.0 |
      | PostgreSQL |       10.5 |

***** Preferred Minikube config                                    :minikube:
      :PROPERTIES:
      :CUSTOM_ID: preferred-minikube-config
      :END:

      #+BEGIN_SRC shell
        minikube config set bootstrapper kubeadm
        minikube config set kubernetes-version v1.11.2
        minikube config set cpus 4
        minikube config set memory 8192
        minikube config set vm-driver hyperkit
        minikube config set v 4
        minikube config set WantReportErrorPrompt false
      #+END_SRC

***** Preventing Shell History
      :PROPERTIES:
      :CUSTOM_ID: preventing-shell-history
      :END:

      One technique to avoid this is to prefix the command with a space, which
      instructs appropriately-configured shells to omit the following command
      from persisted history.

      Bash users should take a look at the documentation around [[https://www.gnu.org/software/bash/manual/html_node/Bash-History-Facilities.html][history
      facilities]], paying close attention to environment variables such as
      ~HISTFILE~, ~HISTIGNORE~ and ~HISTCONTROL~.

      ZSH users similarly can look at [[http://zsh.sourceforge.net/Doc/Release/Options.html#History][their own documentation]], such as the
      variable ~HIST_IGNORE_SPACE~.

      Fish users like myself can be smug about this behavior being built in.

